* Demo Time

- Let's print a number in javascript:
#+BEGIN_SRC js :results output
  console.log('hello world')
#+END_SRC

#+RESULTS:
: hello world

- The same in python:
#+BEGIN_SRC python :results output
  print('hello world')
#+END_SRC

#+RESULTS:
: hello world

* ~

We can also pass variables to other languages.

#+BEGIN_SRC sh :var input=random-gen()
  echo $input
  printf $input | wc -m
#+END_SRC

#+RESULTS:
| rIWOmgVacVW6fxa3RMzwz4IZEwBI2i5l |
|                               32 |

#+BEGIN_SRC sh :results value org
  man wc
#+END_SRC
** DONE Base Configuration
CLOSED: [2019-01-05 Sat 17:40]
:LOGBOOK:
CLOCK: [2019-01-05 Sat 17:32]--[2019-01-05 Sat 17:39] =>  0:07
:END:
- The configuration is usually autogenerated by running ```stack init``` in the
  root dir
- Do not touch these files. They are normally auto-generated
- I used the simple template here.
- You really don't need this stuff since the stack will do everything for you

*** DONE Project dependencies
CLOSED: [2019-01-05 Sat 17:46]
:PROPERTIES:
:ORDERED:  t
:END:
:LOGBOOK:
CLOCK: [2019-01-05 Sat 17:45]--[2019-01-05 Sat 17:46] =>  0:01
:END:
- Note the aligning- it makes things easy to read
- Stick to code guidelines

#+NAME: imports
#+BEGIN_SRC haskell
  import Control.Monad (forever, when)
  import Data.Bool     (bool)
  import Data.Char     (digitToInt)
  import Data.List     (isSubsequenceOf)
  import Data.Maybe    (isJust, isNothing)
  import System.Exit   (exitSuccess)
  import System.IO     (hFlush, stdout)
  import System.Random (randomRIO)
#+END_SRC

